<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [

    //定义每页显示多少条数据常量和跳转页常量
    'my_pagination'         => [
        'page_size'         => '8',
        'jumppage'          => '1'
    ],

    //定义网页返回的状态码
    'return_code'           => [

        /* 1xx状态码 */
        'continue'          => '100',           //继续，请求者应当继续提出请求
        'handover_protocol' => '101',           //请求者已要求服务器切换协议，服务器已确认并准备切换
    ],
];
